## PART I

##### 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [11]:
#Done!
import env
import pandas as pd
import numpy as np

##### 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [5]:
#Done!

##### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [23]:
def get_db_url(user,host,password,schema):
    return f'mysql+pymysql://{user}:{password}@{host}/{schema}'

##### 4. Use your function to obtain a connection to the employees database.

In [24]:
conn = get_db_url(env.user, env.host, env.password, 'employees')

##### 5. Once you have successfully run a query:

In [27]:
q1 = '''
    SELECT
        first_name,
        last_name,
        emp_no
    FROM employees
    ORDER BY last_name
    LIMIT 10
'''

In [28]:
df = pd.read_sql(q1, conn)
df

  first_name last_name  emp_no
0     Bartek    Aamodt   11761
1     Aluzio    Aamodt   15427
2     Dekang    Aamodt   18182
3       Matt    Aamodt   16572
4    Mokhtar    Aamodt   12791
5  Sreenivas    Aamodt   12516
6     Sachem    Aamodt   12982
7      Basim    Aamodt   17400
8      Vidar    Aamodt   19898
9   Takanari    Aamodt   17885

##### 5.a. Intentionally make a typo in the database url. What kind of error message do you see?

In [22]:
#used 'empoyees' instead of 'employees' 
#returns (1044, "Access denied for user to database 'empoyees'")

##### 5.b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
#used ORDERBY instead of ORDER BY
#returns (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'last_name\n    LIMIT 10' at line 6")

##### 6. Read the employees and titles tables into two separate DataFrames.

In [29]:
emps = '''
    SELECT *
    FROM employees
'''

titles = '''
    SELECT *
    FROM titles
'''

In [30]:
emps_df = pd.read_sql(emps, conn)
titles_df = pd.read_sql(titles, conn)

##### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [31]:
emps_df.shape

(300024, 6)

In [32]:
titles_df.shape

(443308, 4)

##### 8. Display the summary statistics for each DataFrame.

In [33]:
emps_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [34]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

##### 9. How many unique titles are in the titles DataFrame?

In [36]:
len(titles_df.title.unique())

7

##### 10. What is the oldest date in the to_date column?

In [40]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

##### 11. What is the most recent date in the to_date column?

In [43]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

## PART II